// --------------------------------------------------------------------------
// cpp.
//
// --------------------------------------------------------------------------

#include "test_item_base.h"
#include <tchar.h>
#include "Singleton\C11_Singleton.h"
#include "test_c11singleton.h"

// --------------------------------------------------------------------------
//
// --------------------------------------------------------------------------
TEST_ITEM_BASE::TEST_ITEM_BASE() : ITEM_BASE(), value(0)
{
	//반복시킬겁니다.~~~
	//request_rerun_on_completion();
}

// --------------------------------------------------------------------------
//
// --------------------------------------------------------------------------
TEST_ITEM_BASE::~TEST_ITEM_BASE()
{

}

// --------------------------------------------------------------------------
//
// --------------------------------------------------------------------------
void TEST_ITEM_BASE::do_work()
{
	//여기다 반복하고픈 code작성하면됨.
	/*
	_tprintf(_T(" TEST_ITEM_BASE \n"));
	for (value = 0; value < 100; value++)
	{

		_tprintf(_T(" TEST_ITEM_BASE count = %d \n"), value);
		Sleep(10);
	}
	*/
	TEST_C11SINGLETON::get_Instance().test_function();

	request_rerun_on_completion();
}


